recipes = {'Бутерброд с ветчиной': {'Хлеб': 50, 'Ветчина': 20, 'Сыр': 20},
           'Салат Витаминный': {'Помидоры': 50, 'Огурцы': 20, 'Лук': 20, 'Майонез': 50, 'Зелень': 20}}

store = {'Хлеб': 250, 'Ветчина': 120, 'Сыр': 120,
         'Помидоры': 50, 'Огурцы': 20, 'Лук': 20,
         'Майонез': 50, 'Зелень': 20}


def check_portions(food, count, recipes=recipes, store=store):
    # напишите вашу реализацию функции здесь

        a = min(store.get(k,0) // v for k, v in recipes.get(food).items())
        return (0, a,) if a < count else (1, count,)
